Autodesk.Revit.DB.Lighting.RectangleLightShape.EmitWidth
The emit width.
The emit width as a numerical value in feet between 1.0e-9 and 30000.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.
Since:
2013

Autodesk.Revit.DB.Lighting.RectangleLightShape.EmitLength
The emit length.
The emit length as a numerical value in feet between 1.0e-9 and 30000.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.
Since:
2013

Autodesk.Revit.DB.Lighting.RectangleLightShape.#ctor(Autodesk.Revit.DB.Lighting.RectangleLightShape)
Creates a copy of the given rectangle light shape
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.RectangleLightShape.#ctor(System.Double,System.Double)
Creates a rectangle light shape object with the given emit length and width.
emitLength:
The emit length as a numerical value in feet between 1.0e-9 and 30000.0
emitWidth:
The emit width as a numerical value in feet between 1.0e-9 and 30000.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.
Since:
2013

Autodesk.Revit.DB.Lighting.RectangleLightShape.#ctor
Creates a rectangle light shape object with 4.0' emit length and a 2.0' emit width.
Since:
2013

Autodesk.Revit.DB.Lighting.RectangleLightShape
This class encapsulates a rectangle light shape.
Since:
2013